{"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "Embedding", "config": {"dtype": "float32", "batch_input_shape": [null, 75], "trainable": true, "embeddings_regularizer": null, "mask_zero": false, "input_dim": 1000, "name": "embedding_4", "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "output_dim": 128, "activity_regularizer": null, "input_length": 75}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "unroll": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "stateful": false, "units": 128, "activity_regularizer": null, "activation": "tanh", "name": "lstm_4", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "linear", "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "sigmoid"}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}